Tekla Open API Reference for Tekla Structures 2025
ControlCircle Properties
The ControlCircle type exposes the following members.
Properties
Name | Description
Color
 Gets or sets the color of the control circle.
Extension
 Gets or sets the extension of the control circle.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LineType
 The line type of the control circle.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Point1
 Gets or sets the first point. Point1 becomes the center point of the circle after selecting the control circle.
Point2
 Gets or sets the second point. Point2 contains the original input Point1 after selecting the control circle.
Point3
 Gets or sets the third point. Point3 contains the calculated result from the orthogonal point and the center point after selecting the control circle.
Top
See Also
Reference
ControlCircle Class
Tekla.Structures.Model Namespace